# 데이터 추출 from 데이터프레임

한 줄만 추출할 때 [] : 시리즈, [[ ]] 해주면 데이터프레임

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
         "b" : [7, 8, 9],
         "c" : [10, 11, 12]},
        index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [3]:
df1 = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2)],
        names=['n','v']))
df1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## 열로 추출하기
  - 데이터명['열 이름']
  - 데이터명['열 이름'] / 데이터명 [['열 이름1','열 이름2',,,,'열 이름n']] 
  - 데이터명.loc[:,'열 이름'] / 데이터명.loc[:,['열 이름1','열 이름2',,,,'열 이름n']]
  - 데이터명.iloc[:.열 번호] / 데이터명.iloc[:,['열 번호1','열 번호2',,,,'열 번호n']]

In [4]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
df['a']

1    4
2    5
3    6
Name: a, dtype: int64

In [6]:
df[['a']]

   a
1  4
2  5
3  6

In [7]:
df[['a','b']]

   a  b
1  4  7
2  5  8
3  6  9

In [8]:
df.loc[:,'a']

1    4
2    5
3    6
Name: a, dtype: int64

In [9]:
df.loc[:,['a']]

   a
1  4
2  5
3  6

In [10]:
df.loc[:,['a','b']]

   a  b
1  4  7
2  5  8
3  6  9

In [11]:
df.iloc[:,0]

1    4
2    5
3    6
Name: a, dtype: int64

In [12]:
df.iloc[:,[0]]

   a
1  4
2  5
3  6

In [13]:
df.iloc[:,[0,1]]

   a  b
1  4  7
2  5  8
3  6  9

In [14]:
df1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [15]:
df1['a']

n  v
d  1    4
   2    5
e  2    6
Name: a, dtype: int64

In [16]:
df1['a']["d"]

v
1    4
2    5
Name: a, dtype: int64

In [17]:
df1.loc["d","a"]

v
1    4
2    5
Name: a, dtype: int64

In [18]:
df1.loc["d",["a"]]

   a
v
1  4
2  5

In [19]:
df1.loc[[("d",1),("e",2)],"a"]

n  v
d  1    4
e  2    6
Name: a, dtype: int64

In [20]:
df1.loc[[("d",1),("e",2)],["a"]]

     a
n v
d 1  4
e 2  6

In [21]:
df1.iloc[0:2,0]

n  v
d  1    4
   2    5
Name: a, dtype: int64

In [22]:
df1.iloc[0:2,[0]]

     a
n v
d 1  4
  2  5

In [23]:
df1.iloc[[0,2],0] # 중간 한줄 뛰어넘음

n  v
d  1    4
e  2    6
Name: a, dtype: int64

In [24]:
df1.iloc[[0,2],[0]]

     a
n v
d 1  4
e 2  6

## 행으로 추출하기
  - 데이터명.loc['인덱스값',:] / 데이터명.loc[['인덱스값1','인덱스값2',,,,'인덱스값n'],:]
  - 데이터명.iloc[인덱스 번호,:] / 데이터명.iloc[['인덱스 번호1','인덱스 번호2',,,,'인덱스 번호n'],:]

In [25]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [26]:
df.loc[1]

a     4
b     7
c    10
Name: 1, dtype: int64

In [27]:
df.loc[[1]]

   a  b   c
1  4  7  10

In [28]:
df.loc[[1,3]]

   a  b   c
1  4  7  10
3  6  9  12

In [29]:
df.iloc[0,:]

a     4
b     7
c    10
Name: 1, dtype: int64

In [30]:
df.iloc[[0],:]

   a  b   c
1  4  7  10

In [31]:
df1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [32]:
df1.loc["d"]

   a  b   c
v
1  4  7  10
2  5  8  11

In [33]:
df1.loc["d",1] # 시리즈 반환

a     4
b     7
c    10
Name: (d, 1), dtype: int64

In [34]:
df1.loc[("d",1)] # 시리즈 반환

a     4
b     7
c    10
Name: (d, 1), dtype: int64

In [35]:
df1.loc[[("d",1)]] # 데이터프레임 반환

     a  b   c
n v
d 1  4  7  10

In [36]:
df1.loc[('d',1):('e',2)]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [37]:
df1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## 셀로 추출하기

In [38]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [39]:
df["a"][1]

4

In [40]:
df.loc[1,"a"]

4

In [41]:
df.loc[1,:]["a"]

4

In [42]:
df.iloc[0,0]

4

In [43]:
df.iloc[0,:][0]

4

In [44]:
df1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [45]:
df1['a']["d"][1]

4

In [46]:
df1['a']["d",1]

4

In [47]:
df1.loc[("d",1),"a"]

4

In [48]:
df1.loc[("d",1),:]["a"]

4

In [60]:
df1.iloc[[0],:]["a"]

n  v
d  1    4
Name: a, dtype: int64

In [61]:
df1.iloc[[0],:][["a"]]

     a
n v
d 1  4

In [73]:
df1.iloc[[0],[0]]['a']

n  v
d  1    4
Name: a, dtype: int64

In [72]:
df1.iloc[[0],[0]][['a']]

     a
n v
d 1  4